[
{"Company Name": "JULO", "Company Location": "ID", "Website": "https://www.julo.co.id", "Working Location": "Jakarta", "Job Title": "Senior Data Scientist", "Minimal Year Experience": 3, "Currency": "-", "Minimal Salary": "-", "Maximan Salary": "-", "Job Description": "Roles and Responsibilities: -- Plan, develop and deploy machine learning models and advanced analytics solutions to solve business problems -- Define problems and hypotheses, develop recommendations and decision support tools to increase business value -- Continuously improve the predictive value of our models, monitor model performance in production systems closely -- Develop a culture of highly reproduceable work, attention to detail, quality of work and getting solutions to production quickly --  -- Requirements: -- Exceptional CAN-DO ATTITUDE -- 3+ years of experience of applied Quantitative Analysis, Statistical Analysis or Modelling -- 3+ years of experience in Python or R, and proficiency in Numpy, Pandas, Scikit-learn or equivalent in R, AutoML frameworks -- Solid communication skills (Bahasa Indonesia and English) -- You must be results-oriented and willing to work in a fast and dynamic environment -- Deep understanding of Linear Algebra, (Multivariate) Calculus, Applied Mathematics and Statistics, Algorithms and complex optimization -- Master’s degree in Statistics, Mathematics, Applied Math, Engineering, Computer Science, or similar advanced degree is preferred --  -- Nice to have experience in any of the following: -- Experience with A/B testing and experimentation -- Domain knowledge in credit scoring, risk or loan portfolio management -- PhD Degree in Statistics, Mathematics, or Applied Mathematics"},
{"Company Name": "Qiscus Pte Ltd", "Company Location": "ID", "Website": "https://www.qiscus.com", "Working Location": "Yogyakarta", "Job Title": "Back End Developer", "Minimal Year Experience": 0, "Currency": "-", "Minimal Salary": "-", "Maximan Salary": "-", "Job Description": "Our goal at Qiscus is to build the best real-time communication engine that powerfully enable conversations in any apps.  What we’re looking for: a software engineering generalist who’s passionate and cares deeply about product development. \n \nAt Qiscus, our engineers are always learning new things — we each have our areas of expertise, but we all work toward cross-platform and full-stack. We pride ourselves on writing high-quality code and maintainable systems that make our lives easier, across  PHP, Python, Golang, Elixir, Ruby, SQL, UML, and ERD. Every engineer works on exciting, meaningful projects that impact our technical and product strategy.\n \nWe work closely with Product Managers and Designers to define new features, and help map the future of Qiscus. We’re building the next generation of products leveraging frameworks, such as Rails, Laravel, Gin, or Phoenix, and tackling complex problems related to large-scale backend infrastructure and mobile platforms. We’re building a team of talented, thoughtful people who will work together to build an enduring company that will change the way teams work together.\n \nAre you the one that we are looking for?\n \n Responsibilities: -- Integration of user-facing elements developed by a front-end developers with server side logic -- Building reusable code and libraries for future, include documentation UML. -- Optimization of the application for maximum speed and scalability. -- Implementation of security and data protection. -- Design and implementation of data storage solutions (ERD). -- Requirements: -- Extraordinary software engineering talent -- Knowledge of Ruby, PHP, Phyton, SQL, Java or the ability to learn them quickly. Golang or Elixir is a plus. -- Experience with web applications, databases and distributed systems (deployment). -- Understand mobile development is a plus. -- Experience  create RESTful  and Mock API. -- Data migration, transformation, and scripting/automation. -- Passion for learning and working with others to improve yourself, the team, the product, the company"},
{"Company Name": "Jakmall.com", "Company Location": "ID", "Website": "http://www.jakmall.com", "Working Location": "Jakarta", "Job Title": "Backend Developer", "Minimal Year Experience": 1, "Currency": "IDR", "Minimal Salary": 7000000, "Maximan Salary": 17000000, "Job Description": "Job Description\n       As a Backend Developer, you will write a good, clean, readable, and reusable code that covers PHP-Laravel, Docker, NodeJS, Python, Angular, Git and SQL for scalable and optimized web-based application. You will work together with the development team to design and implement secure data storage solutions to achieve product goals. --  -- Requirements: -- Bachelor Degree of Computer Science, Informatics Engineering or related fields -- Minimal 1-year experience as Back-end Developer -- Proficient with PHP - Laravel, Git, Docker, Symfony, VueJS, ReactJS, and Angular -- Portfolio needed (link) -- Jakarta Barat Placement"},
{"Company Name": "Mitra Infoparama", "Company Location": "ID", "Website": "http://www.mip.co.id", "Working Location": "Jakarta", "Job Title": "Developer Python", "Minimal Year Experience": 3, "Currency": "-", "Minimal Salary": "-", "Maximan Salary": "-", "Job Description": "  -- Minimum D3 Teknik Informatika - terutama jurusan pemrograman aplikasi berbasis jejaring (web application) -- Menguasai bahasa pemrograman untuk aplikasi berbasis jejaring (diutamakan Go, Python, C, Django) -- Menguasai pendukung pemrograman terkait aplikasi berbasis jejaring (web server, database server) -- Pernah membuat aplikasi berbasis web (baik untuk skripsi, hobi atau pekerjaan), serta dapat mendemokan hasil kerjanya -- Diutamakan yang sudah berpengalaman 3 tahun atau lebih -- Rajin, berdedikasi dan berkeinginan kuat untuk menciptakan program yang bersumbangsih besar bagi perusahaan -- Penempatan di Pondok Bambu, Jakarta Timur"},
{"Company Name": "Haruplate", "Company Location": "SG", "Website": "http://haruplate.com", "Working Location": "Jakarta", "Job Title": "Data Scientist", "Minimal Year Experience": 1, "Currency": "-", "Minimal Salary": "-", "Maximan Salary": "-", "Job Description": "Job Descriptions -- Design, plan and execute the company’s data mining, analytics, and business intelligence strategies. -- Work closely with stakeholders to understand the company vision, scope the problem, and develop solutions together with core team members in content marketing, digital marketing, and product innovation. -- Perform data cleaning, pre-processing and feature engineering that facilitate meaningful analysis -- Mine insights from structured and unstructured e-commerce and social media data. -- Resolve data and present recommendations to be executed or tested. -- Design dashboards and interactive visualization as tools for data exploration as well as for storytelling. Present analytics insights to business users and stakeholders -- Work with stakeholders to ensure smooth deployment and adoption of new solution -- Data Analytics Task -- Gather & analyse data from sales, ads, marketing(email, social media, partnership), customer feedback, and customer profile, and production.  -- Develop dashboards and reports for business teams to use for critical decision making or insights-based planning -- Data Science Tasks -- Brand and product Sentiment analysis  -- Sensory profiling to provide intelligence for product innovation and development -- Periodic Industry trends analysis -- Data Warehousing -- Help to advise, structure and maintain a data warehouse that would be suitable for the company’s needs as the company grows. -- Requirements -- Degree/Master in Computer Science, Electronics Engineering, or related IT disciplines -- Minimum 2-3 years of relevant working experience -- Experience in consumer retail and ecommerce analytics projects is a plus. Got young kids? even better! -- Ability to take a broad, strategic perspective as well as drill deep to understand business needs and challenges -- Ability to implement small data as well as big data strategies. -- Motivated and keen to grow with a startup in the food services industry. -- Training and relevant experience in one or more of the following areas: -- Statistical modelling tools such as: R, Python, RapidMiner, Knime, SAS, Matlab or SPSS -- Data manipulation using scripting languages like Python or using ETL tools -- Visual analytics technologies like Tableau, Qlikview or D3.js -- End-to-end analytics architecture -- Excellent communications skills, both oral and written. -- Strong analytical, conceptualisation and problem solving skills -- Passion for the use of analytics and data to improve product innovation and identifying market trends."},
{"Company Name": "Studycle", "Company Location": "SG", "Website": "https://studycle.com", "Working Location": "Bekasi", "Job Title": "Software Engineer", "Minimal Year Experience": 1, "Currency": "-", "Minimal Salary": "-", "Maximan Salary": "-", "Job Description": "We are an edu-tech company delivering better learning experience and opportunities to everyone through our proprietary learning solution that includes software, hardware, and learning materials, customised for local needs.  -- We also offer co-learning space that provides enrichment classes to complement and supplement formal education. -- As our Software Engineer, you are able to choose to become a front-end specialist or a back-end ninja to work together in our product development team for creating awesome educational applications. --  -- Responsibilities: -- Develops web applications, mainly for K-12 educational interactive applications -- Creates and maintains technical and user documentations -- Works with content and design team to create intuitive and attractive applications --  -- Requirements: -- Proficient in Javascript or Python -- Experience in either modern Javascript framework (i.e. React, Angular, Vue) or back-end framework (i.e. Django, Rails, Laravel) -- Familiar with any database system -- Experience in HTML5, CSS3 -- Knowledge of OOP and software design patterns -- Comfortable working with version control such as Git -- Good level of English (oral and written) -- Self-motivated and able to work independently with minimal supervision -- Open to receive and act on constructive criticism -- A passion for children or better education"},
{"Company Name": "PT YOU Indonesia", "Company Location": "ID", "Website": "http://youvit.co.id", "Working Location": "Jakarta", "Job Title": "Senior Business Intelligent Engineering  ", "Minimal Year Experience": 5, "Currency": "-", "Minimal Salary": "-", "Maximan Salary": "-", "Job Description": "Responsibilities -- Our senior Business Intelligence Engineer will have the following responsibilities: -- • Data Architecture\n o Built data architecture in support of fostering a data-driven company culture. Amongst others, this includes building the necessary infrastructure for data integration, data storage and data visualisation in support of supply chain management, finance, marketing and sales;  -- o Built data warehouse in support \nof clean and secure data warehousing and a set of informative dashboards and reporting structures to link daily sales, stock and merchandise reports to actionable follow-up; -- o Strategize and execute upon innovative ways of data collection to support improved understanding of business operations and end consumer; -- • ERP System\no Source a fitting Enterprise Resource Planning(ERP)system or a combination of applications in support of the integrated management of core business process including procurement, production, distribution, accounting and human resource;\no Implement the newly sourced ERP system or applications from scratch and integrate with Salesforce software, which is overseeing customer services and sales processes; -- o Lead the adoption of new software tools to improve the management of our operations across departments. Business operations that require tools for data driven management include manpower operations, supply chain operations and marketing operations; -- • Salesforce\no Train sales team members on usage of newly adopted Sales force software and evaluate user experience in order to increase adoption rate; -- o Expand functionality Salesforce by customization, amongst others in support of improved tracking of KPI’s, forecasting & budgeting; -- o Support implementation of Sales force for other departments,amongst others the marketing department; -- • BI Team\no Recruit, train and manage a BI team, initially consisting of a Commercial Analyst and Commercial Admin. -- o Assist the sales team with data analyses and administration; -- o Make reports and analyse data with respect to sales performance;  -- o Assist on any other data analyses and business intelligence topics; -- • Business Development\n o Translate data insights into execution-able initiatives; -- o Strategize, built and deploy new IT projects; -- o Be ready to jump in and help out on many other related topics; --  -- Qualifications --  Solid academic background; especially majoring in computer science, information systems or engineering from top 10 university in Indonesia combined with international experience while studying abroad; --  A minimum of 5 years of work experience in a fast-paced work environment, experience in database queries of consumer (health & beauty) products is preferred; -- Excellent communication and writing skills; Good command in English and Bahasa Indonesia; -- Strong in quantitative and qualitative reasoning and good with numbers. Familiar with projectmanagement and reporting -- High moral standards and personal qualities of integrity, credibility, commitment to the business; -- Able to work within an ambiguous and fast-paced environment; -- Strong feeling of responsibility; -- Minimum Qualifications -- ● Demonstrated strong analytical skills - 'getting-things-done' over a process driven mentality; systematic thinking, strong analytical, communication and Excellent problem-solving skills; --  ○  Understand database and data pipeline concept (ETL/ELT) --  ○  Expert in data modelling through queries (SQL) and data visualization --  ○  Familiar in creating automation through scripting (Python, R) --  ○  Ability to determine key metrics and strong business process understanding --  ○  Have experience with GCP/AWS/Azure --  ○  Have minimum 3+ years of experience leading a small team -- ● Nice to Have Experience: --  o Metabaseorsimilarplatforms(Tableau,GoogleDataStudio,etc.)  --  o Exposure to FMCG/retail\n o Salesforce,ERP -- Snapshot of the Role -- Location : Jakarta\nNationality : Any\nStart date : ASAP\nLanguage : Fluent in English\nEducation : University Degree\nExperience : 5 to ten years\nContract : Three-month fit-period, full time position afterwards -- Compensation : Competitive salary  -- Reporting to: COO"},
{"Company Name": "Cranium.id", "Company Location": "ID", "Website": "http://cranium.id", "Working Location": "Jakarta", "Job Title": "Lead Programmer", "Minimal Year Experience": 0, "Currency": "-", "Minimal Salary": "-", "Maximan Salary": "-", "Job Description": "Job Description: -- - Technical Design and implement the company’s products -- - Ensure the technical feasibility of UI/UX designs -- - Act as the technical subject matter expert to mentor fellow engineers, demonstrate technical expertise, and lead a small team in solving challenging programming and design problems -- - Solve security-related problems on the Web/UI/Cloud stacks -- - Build efficient and reusable components -- - Contribute to every part of our product pipeline from inception to delivery -- - Design and conduct code reviews, unit tests, and test automation -- - Write clean, reusable, maintainable code -- - Design and implement RESTful APIs -- - Excellent communication skills: Demonstrated ability to explain complex technical issues to both technical and non-technical audiences -- A team-oriented approach, with a willingness to receive feedback and iterate on designs --  -- Required skills and experience: -- - 5+ Years Experience in software development -- - Knowledge in Agile methodology of running projects -- - Excellent understanding in the concept of APIs and Frontend-Backend communication -- - Strong knowledge in Java Spring Boot / Node JS / Go -- - Proficient understanding in Mobile App SDK (Java, Kotlin, React Native) -- - Strong knowledge in SQL Server, Mysql efficient table schema & database querying -- - Experience with NOSQL databases and related implementations -- - Knowledge of modern development principles and best practices (Object Oriented Programming, Design Patterns, unit testing, continuous integration and deployment) -- - Release & Configuration management practices, Git and CI/CD. -- - Experience in leading a team of developers. -- - Experience in testing and test frameworks. -- - Experience in designing database schemas -- - Bonus if you have Chatbot/ Machine learning/ Natural Language Processing/ Python coding experience -- - Good teamwork skills, capable in collaborating with other team members -- A self-starter who loves to own things end-to-end"},
{"Company Name": "Finantier", "Company Location": "ID", "Website": "https://finantier.co", "Working Location": "Jakarta", "Job Title": "Senior Backend Software Engineer", "Minimal Year Experience": 3, "Currency": "USD", "Minimal Salary": 12000, "Maximan Salary": 20000, "Job Description": "About us -- At Finantier we are building the infrastructure for the next generation of Financial Services across Southeast Asia. -- We are a VC backed startup creating from scratch an holistic platform  to allow consumers to control and leverage on their data to access  better financial products and empowering innovators to build and scale  amazing tailored solutions for their users. -- Our team is small but growing fast, there’s a lot of room for career growth and also a lot to have fun along the way. -- Responsibilities -- As a Senior Backend Engineer you’ll have the opportunity to work in the following items, among others: -- Build and deploy microservices written in Golang. -- Build and deploy scripts and data processors in Python. -- Develop and maintain our API with highest standards in terms of security and performance. -- Develop using TDD to make sure code is delivered with Quality. -- Perform database updates and work with huge datasets. -- Gets your hand on Machine Learning related projects. -- Setup and maintain CD/CI infrastructure and processes. -- Manage cloud services. -- Maintain internal and public documentation about our products and services. -- Have fun and enjoy what you do. -- You are -- Highly motivated and self driven. -- Enjoy collaborating and working in small teams and cross teams. -- Technically strong and hands-on. -- Good at multitasking and thrive in fast-paced environments. -- Methodical, thorough, and solution oriented. -- Enjoy learning new technologies and applying that to solving problems. -- Great at communicating your ideas. -- Requirements -- Computer Science degree or equivalent working experience in a similar position for +4 years. -- Real world experience working with backend technologies. -- Experience working with NoSQL and relational databases. -- Prior experience working with AWS, GCP or Azure. -- Is a plus if you have prior startup experience or if you worked in a Fintech company. -- Is another plus if you had the chance to work with data and analytics. -- Tech Stack -- We use Python, Golang and Rust for backend in a microservices  architecture, we also rely on serverless processes in the cloud. We also  use Docker and Kubernetes to deploy our infrastructure. ReactJS is our  library for the frontend. -- As we continue building and evolving our platform, be ready to get up to speed with new technologies and exciting tools. -- Perks -- Real ownership of what you do. -- Work from home with some periodic office time. -- When COVID allows, ability to travel within the region. -- Training budget. -- 15 days vacation + public holidays. -- Flexible working hours. -- Being part of an awesome team, making a real positive impact on people’s lives."},
{"Company Name": "Finantier", "Company Location": "ID", "Website": "https://finantier.co", "Working Location": "Jakarta", "Job Title": "Frontend Software Engineer", "Minimal Year Experience": 1, "Currency": "SGD", "Minimal Salary": 10000, "Maximan Salary": 20000, "Job Description": "About us -- At Finantier we are building the infrastructure for the next generation of Financial Services across Southeast Asia. -- We are a VC backed startup creating from scratch an holistic platform  to allow consumers to control and leverage on their data to access  better financial products and empowering innovators to build and scale  amazing tailored solutions for their users. -- Our team is small but growing fast, there’s a lot of room for career growth and also a lot to have fun along the way. -- Responsibilities -- As a Frontend Software Engineer you’ll have the opportunity to work in the following items, among others: -- Implement frontend solutions to enhance Finantier’s products using ReactJS. -- Build and maintain frontend dashboard, consoles and components. -- Craft great user interfaces by working CSS and similar technologies. -- Work with cutting edge technologies: client / server side rendering. -- Write functional test cases to automate quality assurance. -- Maintain internal and public documentation about our products and services. -- Have fun and enjoy what you do. -- You are -- Highly motivated and self driven. -- Enjoy collaborating and working in small teams and cross teams. -- Technically strong and hands-on. -- Good at multitasking and thrive in fast-paced environments. -- Methodical, thorough, and solution oriented. -- Enjoy learning new technologies and applying that to solving problems. -- Great at communicating your ideas. -- Requirements -- Fresh graduate or equivalent working experience in a similar position for +2 years. -- Prior experience working with ReactJS or similar libraries/frameworks. -- Is a big plus if you have prior startup experience or if you worked in a Fintech or SaaS company. -- Tech Stack -- We use Python, Golang and Rust for backend in a microservices  architecture, we also rely on serverless processes in the cloud. We also  use Docker and Kubernetes to deploy our infrastructure. ReactJS is our  library for the frontend. -- As we continue building and evolving our platform, be ready to get up to speed with new technologies and exciting tools. -- Perks -- Real ownership of what you do. -- Work from home with some periodic office time. -- When COVID allows, ability to travel within the region. -- Training budget. -- 15 days vacation + public holidays. -- Flexible working hours. -- Being part of an awesome team, making a real positive impact on people’s lives."},
{"Company Name": "Finantier", "Company Location": "ID", "Website": "https://finantier.co", "Working Location": "Jakarta", "Job Title": "Senior DevOps Engineer", "Minimal Year Experience": 5, "Currency": "USD", "Minimal Salary": 15000, "Maximan Salary": 25000, "Job Description": "About us -- At Finantier we are building the infrastructure for the next generation of Financial Services across Southeast Asia. -- We are a VC backed startup creating from scratch an holistic platform  to allow consumers to control and leverage on their data to access  better financial products and empowering innovators to build and scale  amazing tailored solutions for their users. -- Our team is small but growing fast, there’s a lot of room for career growth and also a lot to have fun along the way. -- Responsibilities -- As a Senior DevOps Engineer you’ll have the opportunity to work in the following items, among others: -- Run Finantier’s infrastructure using Kubernetes in AWS and Google Cloud Platform. -- Implement security mechanisms and defensive systems. -- Use infrastructure as code technologies. -- Run monitoring and alerting systems. -- Build and maintain CI/CD pipelines. -- Be on an on-call rotation schedule to solve live issues and keep Finantier’s platform up and running. -- Collaborate across multiple teams to address their needs in terms of compliance, product enhancements and performance. -- Maintain internal and public documentation about our products and services. -- Have fun and enjoy what you do. -- You are -- Highly motivated and self driven. -- Enjoy collaborating and working in small teams and cross teams. -- Technically strong and hands-on. -- Good at multitasking and thrive in fast-paced environments. -- Methodical, thorough, and solution oriented. -- Enjoy learning new technologies and applying that to solving problems. -- Great at communicating your ideas. -- Requirements -- Computer Science degree or equivalent working experience in a similar position for +4 years. -- Prior experience working with AWS, GCP or Azure. -- Is a plus if you have prior startup experience or if you worked in a Fintech or SaaS company. -- Is another plus if you had the chance to work with highly scalable distributed systems. -- Tech Stack -- We use Python, Golang and Rust for backend in a microservices  architecture, we also rely on serverless processes in the cloud. We also  use Docker and Kubernetes to deploy our infrastructure. ReactJS is our  library for the frontend. -- As we continue building and evolving our platform, be ready to get up to speed with new technologies and exciting tools. -- Perks -- Real ownership of what you do. -- Work from home with some periodic office time. -- When COVID allows, ability to travel within the region. -- Training budget. -- 15 days vacation + public holidays. -- Flexible working hours. -- Being part of an awesome team, making a real positive impact on people’s lives."},
{"Company Name": "PT Bobobox Mitra Indonesia", "Company Location": "ID", "Website": "http://www.bobobox.co.id", "Working Location": "Bandung", "Job Title": "Backend Engineer", "Minimal Year Experience": 1, "Currency": "-", "Minimal Salary": "-", "Maximan Salary": "-", "Job Description": " About The Role We are looking for a back-end engineer to join our tech team. You will be responsible for the server side of our applications. If you have excellent programming skills and are passionate for developing applications or improving existing ones, we would like to meet you. You are going to write codes that integrate with various systems. Your primary role is designing and developing high-quality backend services and APIs, to achieve long-term maintainability, resilience against failures, and high scalability. About Your Responsibilities  -- Gather, address, and design technical requirements & solutions.  -- Develop, improve, and deploy high quality backend services and APIs.  -- Apply design patterns based on use cases on any project and produce maintainable and  easy to extend code.  -- Learn multiple tech stacks to use the best tools for the job.  -- Build reusable code and libraries for future use.  -- Act as main PIC for production support: troubleshooting, debugging, and fixing.  -- Mentor colleagues and provide feedback to colleagues.  -- Write unit tests to achieve high test coverage.  -- Requirements Minimum  -- Willing to work in Bandung. -- Humble, zero egos, and excellent collaborative spirit. We are all here to learn and grow  together as a team.  -- Have strong analytical skills, and problem-solving capabilities.  -- Eagerness to learn, help, and share.  -- Comfortable with working up and down the technology stack.  -- Eagerness to explore creative solutions and try new things.  -- Have good knowledge and experience in building production level applications in Go,  NodeJs, Java, or Python.  -- Have good communication skills, team player and comfortable to work with a cross functional team.  -- Have a great sense of ownership, urgency, and self-driven.  -- What would make you stand out from the crowd:  -- Have general cloud knowledge and containerization using Docker.  -- Have experience in building automated testing pipelines.3. Have experience in improving non-functional issues (e.g. performance, security).  -- Have experience in troubleshooting server performance - memory issues, resources leaks, etc.  -- Passionate in the field of people management, people growth & mentorship. --  "},
{"Company Name": "Id/x Partners", "Company Location": "ID", "Website": "http://www.idxpartners.com", "Working Location": "Jakarta", "Job Title": "Technical Solution Architect", "Minimal Year Experience": 5, "Currency": "-", "Minimal Salary": "-", "Maximan Salary": "-", "Job Description": "TECHNICAL SOLUTIONS ARCHITECT -- Description -- We are seeking a Technical Solution Architect with IBM Data Integration & Big Data Architect experience. The position will primarily be responsible for identifying best-fit architectural solutions for one or more projects; develop design of application, provide regular support/guidance to project teams on complex coding, issue resolution and execution. You will collaborate and participate in project implementation and various pursuits focused on business needs. You will be part of a learning culture, where teamwork and collaboration are encouraged, excellence rewarded, and diversity is respected and valued. -- Qualification: -- 1. Graduate Bachelor degrees of Computer Engineering, Informatics, Information System, Electrical Engineering -- 2. At least 7 years of experience with Information Technology -- 3. 4+ years of experience in technology consulting, enterprise and solutions architecture and architectural frameworks -- 4. 4+ years of experience in Hadoop ecosystem, i.e. Hadoop, Hive, Scala, SPARK, Sqoop, Flume, Kafka, Python, IBM Datastage/DataQuality, and NoSQL database technologies -- 5. Understanding and knowledge of Hadoop architecture and various components such as high availability architecture, experience in workload management, scalability and distributed platform architecture, Spark tools like RDD transformations, Spark MLIB etc. -- 6. Hands on experience in Hadoop technologies, Spark -- 7. Knowledge and experience with full SDLC lifecycle -- 8. Experience in a solid knowledge of distributed architectures. -- 9. Demonstrated experience and ability to apply architectural principles to business solutions. This role should have extensive background in designing in integrating disparate systems and should be able to provide guidance based on his experience & expertise. -- 10. Exceptional communication skills and the ability to communicate appropriately at all levels of the organization; this includes written and verbal communications as well as visualizations. -- 11. Demonstrated ability to build consensus among many stakeholders -- 12. Knowledge of architectural design frameworks, integration frameworks, and patterns -- 13. Have high commitment and able to meet project’s target in team with tight deadline -- 14. Strong analytical skills and troubleshooting skills. -- Job Description: -- 1. This role will provide assistance with design as well as coordination efforts. -- 2. This role will lead the design reviews sessions and the collaboration effort. She/he will lead the design and modeling of tactical architectures for delivery, development, and support of projects -- 3. Keep skills updated and remain proactively aware of happenings and current events in the industry"},
{"Company Name": "Id/x Partners", "Company Location": "ID", "Website": "http://www.idxpartners.com", "Working Location": "Jakarta", "Job Title": "Big Data Developer (Spark)", "Minimal Year Experience": 1, "Currency": "-", "Minimal Salary": "-", "Maximan Salary": "-", "Job Description": "Qualification: -- 1. Graduate Bachelor Degree of Computer Engineering, Informatics, Information System, Electrical Engineering -- 2. Have 2+ years of development experience in area of Cloudera, Hadoop, SPARK, MapReduce, Hive, Impala, Kafka and HBASE -- 3. Familiar with Linux/Unix Scripting, Sqoop, Oozie, and real time data ingestion into Hadoop -- 4. Familiar with SoapUI, Postman, or other API Testing Tools  -- 5. Familiar with File Compression in Hadoop -- 6. Familiar with Java (and/or Scala, Python) -- 7. Familiar with application of standard software development principles. -- 8. Self-motivated, driven, fast learner -- 9. Have high commitment and able to meet project’s target in team with tight deadline -- 10. Good communication, strong analytical skills, and problem-solving skills -- 11. Possess good command of English --  -- Job Description: -- 1. Building, Implementing, and maintaining code for big data ingestion using Spark, Impala, etc -- 2. Designing schemas, data models and data architecture for Hadoop environments -- 3. Developing and executing quality assurance and test scripts -- 4. Work with business analysts to understand business requirements and use cases -- 5. Problem solving and fixing technical issues -- 6. Developing technical documentation"},
{"Company Name": "BAMMS (PT Teknologi Optimal Prima)", "Company Location": "ID", "Website": "http://www.bamms.co", "Working Location": "Jakarta", "Job Title": "Quality Assurance", "Minimal Year Experience": 1, "Currency": "-", "Minimal Salary": "-", "Maximan Salary": "-", "Job Description": "Job Description: -- o Assure the quality of Web and Mobile Application according to requirements. -- o Work together with Product Owner and Product Manager to define acceptance criteria. -- o Proficient with QA testing methodologies and test types such as Test Plans, Suites and Cases, Functional, Negative, Integration, Security, Performance, Regression -- o Identify and Report Bugs --  -- Requirement: -- o Familiar with QA process in Software Development -- o Good knowledge of mobile and web products, able to benchmark, evaluate and critic top apps in the market and suggest quality improvements -- o Familiarity with common web and mobile apps automated testing tools such as Selenium, Katalon Studio -- o Hard worker, fast learner, good communication skill and analytical thinking -- o Have a background knowledge in Computer / Informatics Engineering / Informatics System -- o Familiar with source code repository management. e.g: Git -- o Familiar with api testing using Postman or JMeter -- o  Familiar with at least one scripting language, such as Java, Python, PHP; -- o Strong analytical and troubleshooting skill, must be able to think out of the box when testing apps in order to create positive and negative test cases"},
{"Company Name": "PT. Global Infotech Solutions", "Company Location": "ID", "Website": "https://www.global-infotech.co.id", "Working Location": "Jakarta", "Job Title": "Engineer", "Minimal Year Experience": 0, "Currency": "IDR", "Minimal Salary": 3000000, "Maximan Salary": 5000000, "Job Description": "1. Menguasai opensource system dan Linux -- 2. Menguasai Mysql Database, Mongodb, Infuxdb  -- 3. Menguasai Scripting Shell dan Python. -- 4. Niat belajar -- 5. Pendidikan min. STM atau SMK"},
{"Company Name": "mHealthBank", "Company Location": "SG", "Website": "http://www.mhealthbank.com", "Working Location": "Jakarta", "Job Title": "Senior BACKEND .NET Engineer", "Minimal Year Experience": 3, "Currency": "IDR", "Minimal Salary": 15000000, "Maximan Salary": 25000000, "Job Description": "Job Duties / Descriptions -- 1. Defining excellent user experience and creating responsive app/web design by using proficiency in front-end coding and development with basic front-end technologies such as Programming Language : Python (Django), Node.js (React), .Net(C#), VueJs 2, HTML5, CSS3 (Less) -- ▪  Database : MySQL, SQL Server -- ▪  Automation : Selenium WebDriver (C#, Java), Jenkins CI -- ▪  Broker message : RabbitMQ , Kafka -- ▪  Cache : Redis, Solr -- ▪  Search Engine : Elastic Search -- ▪  Cloud Providers : AWS, Heroku, Google Cloud Service -- ▪  Modern Architecture : Microservice, Vagrant, Docker -- 2. Strong grasp over logical processes, database-related processes, validation of users requirement and server configuration to optimize the system performances; -- 3. Integrate all elements (including UIs, APIs, Ontology, and semantic database);  -- 4. Strong analytical and troubleshooting skills; -- 5. Able to deliver across entire full app cycle in Agile/Scrum environment. -- 6. Timeline and Quality Oriented -- Technical Skillsets -- 1. Strong understanding of algorithm, create and maintain a robust framework to support the mobile/web deployment; -- 2. Strong experience building Complex Mobile Application using React JS, HTML5, CSS, Swift, and JavaScript consuming RESTful APIs and JSON; -- 3. Good Experience developing SOAP & REST services in Java; -- 4. Good understanding on data structures; -- 5. Good knowledge in develop, manage and perform query the database using MySQL and have an idea about relational and non-relational databases along with the syntax of XML/JSON; -- 6. Solid skills in debugging and provide optimal solutions in problem solving; -- 7. Knowledge of cloud computing frameworks e.g. Azure or IBM BlueMix or Google Cloud Platform -- 8. Keep updated on the latest mobile/web technologies;  -- 9. Willing to strive for a better future together with the company. -- Candidate poses with the following skillset/exposure will be prioritised.  -- 1. Familiar with Python;  -- 2. Experienced in APIs integration with multiple payment gateway, send bird, tokbox, Azure/AWS; -- 3. Good understanding of horizontal concerns within the application (logging, request/response tracking, security, storage); -- 4. Good understanding of compliance (PCI, HIPAA, ISO27001:2013); -- 5. Candidate with exposure of Artificial Intelligence/Machine Learning and/or BlockChain is highly preferred. "},
{"Company Name": "Ula", "Company Location": "ID", "Website": "http://ula.app", "Working Location": "Jakarta", "Job Title": "Software Developer", "Minimal Year Experience": 0, "Currency": "-", "Minimal Salary": "-", "Maximan Salary": "-", "Job Description": "Work with the Product and UX functions to craft innovative solutions to solve real customer pain points -- Work with Engineering and DevOps functions to ensure system reliability, availability and scalability -- Continuously champion high quality software engineering practices - from planning, implementation, test automation, documentation, code reviews, scaling, performance, metrics, logging, and monitoring - essentially the entire software development lifecycle -- Evaluate existing and future cloud-based services to increase the efficiency of our team and/or business -- Grow yourself and your team - mentorship enables everyone to learn and improve -- Requirements -- Proficient in any of the major programming or scripting languages (C++, Java, Python, JavaScript, preferably Node.js) -- Experience with MySQL and PostgreSQL or similar relational databases (non-relational databases a plus) -- Familiarity with agile software development processes for building distributed systems, Android applications, and/or e-commerce platforms -- Self-driven to tackle challenges head-on and achieve goals -- Able to troubleshoot complex systems problems, debug, and find root causes -- Excel at working in small, dynamic, and fast-paced groups -- Ability to communicate in written and spoken English -- Curiosity and capacity to learn"},
{"Company Name": "PT Dapur Rumah Sejahtera", "Company Location": "ID", "Website": "https://twiscode.com", "Working Location": "Surabaya", "Job Title": "Python Developer", "Minimal Year Experience": 1, "Currency": "IDR", "Minimal Salary": 4500000, "Maximan Salary": 6000000, "Job Description": "At least Diploma Degree in Computer Science or related -- 1+ years professional Phyton experience (Flask/ Django/ Tornado) -- Experience in Database SQL (PostgreSQL, MySQL, etc) and NoSQL (MongoDB, Cassandra, dll) -- Have worked with numpy & pandas -- Experience in data related project using python -- Preferably have experience with unit testing and application deployment -- Mathematical and Logical thinking -- Humility, zero egos, and excellent collaborative spirit. -- Eagerness to learn, eagerness to help, eagerness to share"},
{"Company Name": "Fineoz Inovasi Teknologi", "Company Location": "ID", "Website": "http://www.fineoz.com", "Working Location": "Jakarta", "Job Title": "Data Scientist", "Minimal Year Experience": 1, "Currency": "IDR", "Minimal Salary": 5000000, "Maximan Salary": 6000000, "Job Description": "  -- What you'll be responsible for:  -- ·  Develop data sources, anti-fraud model, application scorecard model, presale and cross-sale analytics.  -- ·  Liaise  with Risk Data Architecture manager, Chief Technology Officer, or Head Of Project Management for acquiring relevant data for  modeling purpose, including searching for external data sources, data  crawling, etc -- ·  Collaborate with application development  team (in-house or outsource) for planning and the implementation of the  models into the products -- ·  Gathering feedback and plan for model improvements and better customer experience on a regular basis -- You should possess the following requirements:  -- ·     Degree in Mathematics or Statistic, Qualitative Research, Data Analytics, Machine Learning -- ·     More than 1 years in data analytics -- ·     Strong  experience developing retail credit risk modelling, preferably  application scorecard development or anti-fraud model experience  -- ·     Experience in retail or SME risk assessment engine and anti-fraud engine  -- ·     Good understanding of banking and finance businesses -- ·     Experience with at least two of: SAS, R, Python, SQL -- ·     Experience with machine learning - random forest, GBDT, SVM, is a plus -- ·     Fast learner to understand existing risk models and  conduct customization to fit into local markets -- ·     Experience in team management, strong communication skills and organizational coordination ability -- ·     Equipped with good professional integrity, highly responsible for work, ability to undertake work pressure and challenges -- - have a good attitude"}
]